* DONE Implement parser for org-element-data in OCaml
CLOSED: [2022-11-22 Tue 11:04]
* DONE Write elisp code to remove parent properties 
CLOSED: [2022-11-23 Wed 09:57]
* DONE Write elisp code to get names of all org buffers
CLOSED: [2022-11-23 Wed 10:09]
* DONE Write elisp code to get last modified + changes timestamp for buffer for refreshing agenda view 
CLOSED: [2022-11-23 Wed 10:09]
Check out src_emacs[:exports code]{buffer-modified-tick} and src_emacs[:exports code]{visited-file-modtime}
* DONE On load to home, collect org buffer names, select first and redirect to =/buffer/buffer-name=
CLOSED: [2022-12-01 Thu 03:31]
* DONE Use parameter =/buffer/buffer-name= to collect buffer-name or redirect to first valid buffer name
CLOSED: [2022-12-01 Thu 03:31]
* DONE Render names of all buffers at top of website, on click take to respective page
CLOSED: [2022-12-01 Thu 03:31]
* DONE Render tasks in list
CLOSED: [2022-12-01 Thu 03:31]
* DONE Add on click of element fold
CLOSED: [2022-12-01 Thu 05:42]
* DONE Add filtering panel at top of screen                       :immediate:
CLOSED: [2022-12-01 Thu 10:16]
:LOGBOOK:
CLOCK: [2022-12-01 Thu 05:43]--[2022-12-01 Thu 05:44] =>  0:01
:END:
* DONE Add filter for completed tasks
CLOSED: [2022-12-01 Thu 11:30]
* DONE Add filter for clocked tasks
CLOSED: [2022-12-01 Thu 11:30]
* DONE Add button to show clock duration for tasks with active clock
CLOSED: [2022-12-01 Thu 12:22]
:LOGBOOK:
CLOCK: [2022-12-01 Thu 11:31]--[2022-12-01 Thu 12:22] =>  0:51
:END:
* DONE Add button to show folding
CLOSED: [2022-12-01 Thu 23:12]
** DONE Hide folding buttons on subsections empty 
CLOSED: [2022-12-01 Thu 23:12]
* DONE Fix buffer loading to keep current buffer
CLOSED: [2022-12-02 Fri 01:15]
:LOGBOOK:
CLOCK: [2022-12-02 Fri 01:13]--[2022-12-02 Fri 01:15] =>  0:02
:END:
* DONE Add button to open in emacs
CLOSED: [2022-12-02 Fri 01:35]
** DONE update server to have an endpoint that takes in buffer & timestamp - return none if no change
CLOSED: [2022-12-02 Fri 01:12]
** DONE Update reload button to reload
CLOSED: [2022-12-02 Fri 01:31]
** DONE refresh code on clock edge
CLOSED: [2022-12-02 Fri 01:35]
* DONE Add button to task to open-in-emacs, on click on button, send request to server, server send request to emacs
CLOSED: [2022-12-02 Fri 07:46]
:PROPERTIES:
:ORDERED:  t
:END:
:LOGBOOK:
CLOCK: [2022-12-02 Fri 10:26]--[2022-12-02 Fri 10:26] =>  0:00
CLOCK: [2022-12-02 Fri 07:27]--[2022-12-02 Fri 07:31] =>  0:04
CLOCK: [2022-12-02 Fri 07:25]--[2022-12-02 Fri 07:25] =>  0:00
CLOCK: [2022-12-02 Fri 07:25]--[2022-12-02 Fri 07:25] =>  0:00
CLOCK: [2022-12-02 Fri 07:20]--[2022-12-02 Fri 07:21] =>  0:01
CLOCK: [2022-12-02 Fri 04:02]--[2022-12-02 Fri 04:06] =>  0:04
:END:
** DONE write elisp code to open window to position
CLOSED: [2022-12-02 Fri 07:27]
** DONE add endpoint to open in emacs
CLOSED: [2022-12-02 Fri 07:46]
* DONE Add support to clock in
CLOSED: [2022-12-02 Fri 07:46]
* DONE Add support to clock out
CLOSED: [2022-12-02 Fri 07:46]
* DONE Show running tasks
CLOSED: [2022-12-01 Thu 13:02]
* DONE Add option to hide/show hidden tasks
CLOSED: [2022-12-01 Thu 13:02]
* DONE Fix loading screen
CLOSED: [2022-12-02 Fri 09:53]
:LOGBOOK:
CLOCK: [2022-12-02 Fri 09:24]--[2022-12-02 Fri 09:53] =>  0:29
CLOCK: [2022-12-02 Fri 07:53]--[2022-12-02 Fri 09:23] =>  1:30
:END:
** DONE Find out how to do loading animation
CLOSED: [2022-12-02 Fri 09:24]
:LOGBOOK:
CLOCK: [2022-12-02 Fri 09:23]--[2022-12-02 Fri 09:24] =>  0:01
:END:
* DONE Fix rendering of timestamps such as <2022-12-02 Fri>
CLOSED: [2022-12-02 Fri 11:17]
:LOGBOOK:
CLOCK: [2022-12-02 Fri 10:26]--[2022-12-02 Fri 11:17] =>  0:51
:END:
** DONE If start and end time dates are the same (and no time, or only time on second), only display one 
CLOSED: [2022-12-02 Fri 10:56]
** DONE If start and end time dates differ, draw both with line between them <2022-12-02 Fri>--<2022-12-04 Fri>
CLOSED: [2022-12-02 Fri 11:17]
** DONE If start and end time dates are the same and differing times, display first date, and draw both times with line between them <2022-12-02 Fri 02:30-03:30>
CLOSED: [2022-12-02 Fri 11:17]
* DONE Add warnings panel
CLOSED: [2022-12-02 Fri 12:17]
